# MultiReferenceAnnotationDimensionStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MultiReferenceAnnotationDimensionStyle Property
ParameterTypeId Class See Also
---
"Dimension Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MultiReferenceAnnotationDimensionStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultiReferenceAnnotationDimensionStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MultiReferenceAnnotationDimensionStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace